# 12 차시 - 본문 실습

## 결측치 처리하기

In [1]:
import pandas as pd

data = [
  [  10,   20, None, 100], 
  [  20,   20, None, 200], 
  [None, None, None, None],
  [None, None, None, 400],
]

df = pd.DataFrame(data, columns=list('ABCD'))
df

      A     B     C      D
0  10.0  20.0  None  100.0
1  20.0  20.0  None  200.0
2   NaN   NaN  None    NaN
3   NaN   NaN  None  400.0

In [2]:
df.dropna(how='all')

      A     B     C      D
0  10.0  20.0  None  100.0
1  20.0  20.0  None  200.0
3   NaN   NaN  None  400.0

In [3]:
df.dropna(axis=1, how='all')

      A     B      D
0  10.0  20.0  100.0
1  20.0  20.0  200.0
2   NaN   NaN    NaN
3   NaN   NaN  400.0

## 결측치를 다른 값으로 바꾸기

```python
df.fillna(value=0)
```

In [4]:
data = [
  [  10,   20, None, 100], 
  [  20,   20,   80, 200], 
  [  30,   40, None, 300],
  [None, None,  400, 400],
]

df = pd.DataFrame(data, columns=list('ABCD'))
df

      A     B      C    D
0  10.0  20.0    NaN  100
1  20.0  20.0   80.0  200
2  30.0  40.0    NaN  300
3   NaN   NaN  400.0  400

In [5]:
df.fillna(0)

      A     B      C    D
0  10.0  20.0    0.0  100
1  20.0  20.0   80.0  200
2  30.0  40.0    0.0  300
3   0.0   0.0  400.0  400

In [6]:
df.fillna(-1)

      A     B      C    D
0  10.0  20.0   -1.0  100
1  20.0  20.0   80.0  200
2  30.0  40.0   -1.0  300
3  -1.0  -1.0  400.0  400

## 데이터 병합 concat
```python
pd.concat(axis=0)
```

In [7]:
df_01 = pd.DataFrame([[11, 12, 13], [14, 15, 16]], columns=list('ABC'))
df_01

    A   B   C
0  11  12  13
1  14  15  16

In [8]:
df_02 = pd.DataFrame([[21, 22, 23], [24, 25, 26]], columns=list('ABC'))
df_02

    A   B   C
0  21  22  23
1  24  25  26

In [9]:
pd.concat([df_01, df_02])

    A   B   C
0  11  12  13
1  14  15  16
0  21  22  23
1  24  25  26

In [10]:
df_01 = pd.DataFrame([[11, 12], [14, 15]], columns=list('AB'))
df_01

    A   B
0  11  12
1  14  15

In [11]:
df_02 = pd.DataFrame([[21, 22], [24, 25]], columns=list('CD'))
df_02

    C   D
0  21  22
1  24  25

In [12]:
pd.concat([df_01, df_02])

      A     B     C     D
0  11.0  12.0   NaN   NaN
1  14.0  15.0   NaN   NaN
0   NaN   NaN  21.0  22.0
1   NaN   NaN  24.0  25.0

In [13]:
pd.concat([df_01, df_02], axis=1)

    A   B   C   D
0  11  12  21  22
1  14  15  24  25

## 데이터 병합 - merge

```python
pd.merge(df1, df2, how='inner')
```

In [14]:
관심종목 = [
  ['005930', '삼성전자'],
  ['017670', 'SK텔레콤'],
  ['105560', 'KB금융'],
]

배당 = [
  ['005930', '삼성전자', 21000.0, 1.05],
  ['000660', 'SK하이닉스', 500.0, 1.02],
  ['005380', '현대차', 4000.0, 2.74],
  ['105560', 'KB금융', 980.0, 2.0],
  ['015760', '한국전력', 3100.0, 7.45],
]

df1 = pd.DataFrame(관심종목, columns=['종목코드', '종목명'])
df2 = pd.DataFrame(배당, columns=['종목코드', '종목명', '주당배당금', '배당수익률'])

In [15]:
df1

     종목코드    종목명
0  005930   삼성전자
1  017670  SK텔레콤
2  105560   KB금융

In [16]:
df2

     종목코드     종목명    주당배당금  배당수익률
0  005930    삼성전자  21000.0   1.05
1  000660  SK하이닉스    500.0   1.02
2  005380     현대차   4000.0   2.74
3  105560    KB금융    980.0   2.00
4  015760    한국전력   3100.0   7.45

In [17]:
pd.merge(df1, df2)

     종목코드   종목명    주당배당금  배당수익률
0  005930  삼성전자  21000.0   1.05
1  105560  KB금융    980.0   2.00

In [18]:
pd.merge(df1, df2, how='left')

     종목코드    종목명    주당배당금  배당수익률
0  005930   삼성전자  21000.0   1.05
1  017670  SK텔레콤      NaN    NaN
2  105560   KB금융    980.0   2.00

왼쪽 DataFrame을 기준으로 삼으려면 how='left' 를 지정합니다. 왼쪽 DataFrame에 있는 로우들은 모두 결과에 포함됩니다.

In [19]:
pd.merge(df1, df2, how='outer')

     종목코드     종목명    주당배당금  배당수익률
0  005930    삼성전자  21000.0   1.05
1  017670   SK텔레콤      NaN    NaN
2  105560    KB금융    980.0   2.00
3  000660  SK하이닉스    500.0   1.02
4  005380     현대차   4000.0   2.74
5  015760    한국전력   3100.0   7.45

## 데이터 병합 - 인덱스 활용
```python
df.set_index('index_col') # 인덱스 지정
```

In [20]:
# 종목코드에 인덱스를 부여합니다

관심종목 = [
  ['005930', '삼성전자'],
  ['017670', 'SK텔레콤'],
  ['105560', 'KB금융'],
]

배당 = [
  ['005930', '삼성전자', 21000.0, 1.05],
  ['000660', 'SK하이닉스', 500.0, 1.02],
  ['005380', '현대차', 4000.0, 2.74],
  ['105560', 'KB금융', 980.0, 2.0],
  ['015760', '한국전력', 3100.0, 7.45],
]

df1 = pd.DataFrame(관심종목, columns=['종목코드', '종목명'])
df2 = pd.DataFrame(배당, columns=['종목코드', '종목명', '주당배당금', '배당수익률'])

In [21]:
df1 = df1.set_index('종목코드')
df1

          종목명
종목코드
005930   삼성전자
017670  SK텔레콤
105560   KB금융

In [22]:
df2 = df2.set_index('종목코드')
df2

           종목명    주당배당금  배당수익률
종목코드
005930    삼성전자  21000.0   1.05
000660  SK하이닉스    500.0   1.02
005380     현대차   4000.0   2.74
105560    KB금융    980.0   2.00
015760    한국전력   3100.0   7.45

In [23]:
df1['배당수익률'] = df2['배당수익률']
df1

          종목명  배당수익률
종목코드
005930   삼성전자   1.05
017670  SK텔레콤    NaN
105560   KB금융   2.00

In [24]:
df1[['주당배당금', '배당수익률']] = df2[['주당배당금', '배당수익률']]
df1

          종목명  배당수익률    주당배당금
종목코드
005930   삼성전자   1.05  21000.0
017670  SK텔레콤    NaN      NaN
105560   KB금융   2.00    980.0

## 피벗 (pivot)
```python
df.pivot(index='col_i', columns='col_c', values='col_v')
```

In [25]:
import pandas as pd

data = [
  ['2013-01', 'KT', 60.30],
  ['2013-02', 'KT', 69.60],
  ['2013-03', 'KT', 64.38],
  ['2013-01', 'SKT', 52.77],
  ['2013-02', 'SKT', 95.23],
  ['2013-03', 'SKT', 84.20],
]

df = pd.DataFrame(data, columns=['month', 'corp', 'ad_exp'])
df

     month corp  ad_exp
0  2013-01   KT   60.30
1  2013-02   KT   69.60
2  2013-03   KT   64.38
3  2013-01  SKT   52.77
4  2013-02  SKT   95.23
5  2013-03  SKT   84.20

In [26]:
df.pivot( index='month', columns='corp', values='ad_exp' )

corp        KT    SKT
month
2013-01  60.30  52.77
2013-02  69.60  95.23
2013-03  64.38  84.20

In [27]:
# 간단한 예제 
import pandas as pd

data = [
  ['1', 'A', 10],
  ['1', 'A', 20],
  ['2', 'A', 30],
  ['2', 'B', 40],
]

df = pd.DataFrame(data, columns=['ix', 'col', 'val'])
df

  ix col  val
0  1   A   10
1  1   A   20
2  2   A   30
3  2   B   40

In [28]:
df.pivot_table(index='ix', columns='col', values='val', aggfunc='sum')

col     A     B
ix
1    30.0   NaN
2    30.0  40.0

In [29]:
import pandas as pd

data = [
  ['2013-01', 'KT', 50.30],
  ['2013-01', 'KT', 10.09],
  ['2013-02', 'KT', 69.60],
  ['2013-03', 'KT', 64.38],
  ['2013-01', 'SKT', 52.77],
  ['2013-02', 'SKT', 95.23],
  ['2013-03', 'SKT', 84.20],
]

df = pd.DataFrame(data, columns=['month', 'corp', 'ad_exp'])
df

     month corp  ad_exp
0  2013-01   KT   50.30
1  2013-01   KT   10.09
2  2013-02   KT   69.60
3  2013-03   KT   64.38
4  2013-01  SKT   52.77
5  2013-02  SKT   95.23
6  2013-03  SKT   84.20

In [30]:
df.pivot_table( index='month', columns='corp', values='ad_exp' )

corp         KT    SKT
month
2013-01  30.195  52.77
2013-02  69.600  95.23
2013-03  64.380  84.20

In [31]:
df.pivot_table( index='month', columns='corp', values='ad_exp', aggfunc='sum')

corp        KT    SKT
month
2013-01  60.39  52.77
2013-02  69.60  95.23
2013-03  64.38  84.20

In [32]:
df.pivot_table( index='month', columns='corp', values='ad_exp', aggfunc='sum', margins=True)

corp         KT     SKT     All
month
2013-01   60.39   52.77  113.16
2013-02   69.60   95.23  164.83
2013-03   64.38   84.20  148.58
All      194.37  232.20  426.57